<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use App\Models\Faculty;
use App\Models\Department;

class FacultyDepartmentSeeder extends Seeder
{
    public function run(): void
    {
        $data = [
            'ครุศาสตร์' => [
                ['name' => 'การศึกษาปฐมวัย', 'count' => 54],
                ['name' => 'วิทยาศาสตร์ทั่วไป', 'count' => 46],
                ['name' => 'ฟิสิกส์', 'count' => 34],
                ['name' => 'ภาษาอังกฤษคบ', 'count' => 54],
                ['name' => 'คณิตศาสตร์คบ', 'count' => 49],
                ['name' => 'ภาษาไทย', 'count' => 54],
                ['name' => 'พลศึกษา', 'count' => 54],
                ['name' => 'อุตสาหกรรมศิลป์', 'count' => 18],
                ['name' => 'เคมีคบ', 'count' => 21],
                ['name' => 'คหกรรมศาสตร์', 'count' => 27],
                ['name' => 'สังคมศึกษา', 'count' => 52],
                ['name' => 'การศึกษาพิเศษและภาษาอังกฤษ', 'count' => 43],
                ['name' => 'การประถมศึกษา', 'count' => 59],
                ['name' => 'นวัตกรรมและคอมพิวเตอร์ศึกษา', 'count' => 38],
            ],
            'วิทยาศาสตร์และเทคโนโลยี' => [
                ['name' => 'เคมี', 'count' => 3],
                ['name' => 'ฟิสิกส์', 'count' => 1],
                ['name' => 'คณิตศาสตร์', 'count' => 12],
                ['name' => 'วิทยาการข้อมูล', 'count' => 6],
                ['name' => 'เทคโนโลยีคอมพิวเตอร์และดิจิทัลรหัส65', 'count' => 23],
                ['name' => 'เทคโนโลยีคอมพิวเตอร์และดิจิทัลเทียบโอนรหัส67', 'count' => 9],
                ['name' => 'สาธารณสุขศาสตร์', 'count' => 30],
                ['name' => 'วิทยาศาสตร์สิ่งแวดล้อม', 'count' => 4],
            ],
            'วิทยาการจัดการ' => [
                ['name' => 'การจัดการธุรกิจค้าปลีก', 'count' => 3],
                ['name' => 'การบัญชีห้อง1', 'count' => 34],
                ['name' => 'การบัญชีห้อง2', 'count' => 43],
                ['name' => 'คอมพิวเตอร์ธุรกิจรหัส65', 'count' => 21],
                ['name' => 'คอมพิวเตอร์ธุรกิจเทียบโอนรหัส67', 'count' => 40],
                ['name' => 'นิเทศศาสตร์', 'count' => 29],
                ['name' => 'บริหารธุรกิจแขนงวิชาการจัดการรหัส65', 'count' => 25],
                ['name' => 'บริหารธุรกิจแขนงวิชาการจัดการเทียบโอนรหัส67', 'count' => 17],
                ['name' => 'บริหารธุรกิจแขนงวิชาการจัดการโลจิสติกส์รหัส65', 'count' => 46],
                ['name' => 'บริหารธุรกิจแขนงวิชาการจัดการโลจิสติกส์เทียบโอนรหัส67', 'count' => 9],
                ['name' => 'บริหารธุรกิจแขนงวิชาการตลาด', 'count' => 24],
                ['name' => 'บริหารธุรกิจแขนงวิชาบริหารการเงิน', 'count' => 8],
                ['name' => 'รัฐประศาสนศาสตร์ห้อง1', 'count' => 55],
                ['name' => 'รัฐประศาสนศาสตร์ห้อง2', 'count' => 59],
            ],
            'มนุษยศาสตร์และสังคมศาสตร์' => [
                ['name' => 'การพัฒนาชุมชน', 'count' => 16],
                ['name' => 'ภาษาไทยเพื่อการสื่อสาร', 'count' => 34],
                ['name' => 'ภาษาอังกฤษเพื่อการสื่อสารทางธุรกิจ', 'count' => 50],
                ['name' => 'การท่องเที่ยว', 'count' => 23],
                ['name' => 'ภาษาจีน', 'count' => 26],
                ['name' => 'ทัศนศิลป์', 'count' => 18],
                ['name' => 'ดนตรี', 'count' => 7],
                ['name' => 'นิติศาสตร์ห้อง1', 'count' => 43],
                ['name' => 'นิติศาสตร์ห้อง2', 'count' => 41],
                ['name' => 'รัฐศาสตร์ห้อง1', 'count' => 49],
                ['name' => 'รัฐศาสตร์ห้อง2', 'count' => 51],
                ['name' => 'ภาษาอังกฤษห้อง1', 'count' => 34],
                ['name' => 'ภาษาอังกฤษห้อง2', 'count' => 34],
            ],
            'เทคโนโลยีอุตสาหกรรม' => [
                ['name' => 'เทคโนโลยีเครื่องกลและการผลิตแขนงวิชาเทคโนโลยีการผลิต', 'count' => 6],
                ['name' => 'เทคโนโลยีเครื่องกลและการผลิตแขนงวิชาเทคโนโลยีเครื่องกล', 'count' => 7],
                ['name' => 'เทคโนโลยีไฟฟ้าและอิเล็กทรอนิกส์แขนงวิชาไฟฟ้า', 'count' => 11],
                ['name' => 'เทคโนโลยีไฟฟ้าและอิเล็กทรอนิกส์แขนงวิชาอิเล็กทรอนิกส์', 'count' => 3],
                ['name' => 'เทคโนโลยีโยธาและสถาปัตยกรรมแขนงวิชาเทคโนโลยีโยธา', 'count' => 16],
                ['name' => 'เทคโนโลยีโยธาและสถาปัตยกรรมแขนงวิชาเทคโนโลยีสถาปัตยกรรม', 'count' => 9],
                ['name' => 'วิศวกรรมไฟฟ้าและอิเล็กทรอนิกส์', 'count' => 44],
                ['name' => 'วิศวกรรมเครื่องกลและการผลิต', 'count' => 35],
            ],
            'เทคโนโลยีการเกษตร' => [
                ['name' => 'เทคนิคการสัตวแพทย์', 'count' => 18],
                ['name' => 'พืชศาสตร์', 'count' => 10],
                ['name' => 'สัตวศาสตร์', 'count' => 37],
                ['name' => 'บริหารธุรกิจการเกษตร', 'count' => 3],
                ['name' => 'วิทยาศาสตร์การเพาะเลี้ยงสัตว์น้ำ', 'count' => 5],
            ]
        ];

        foreach ($data as $facultyName => $departments) {
            $faculty = Faculty::firstOrCreate(['name' => $facultyName]);

            foreach ($departments as $dept) {
                Department::updateOrCreate(
                    ['faculty_id' => $faculty->id, 'name' => $dept['name']],
                    ['student_count' => $dept['count']]
                );
            }
        }
    }
}
